In [1]:
import os
from sqlalchemy import create_engine
import pandas as pd

In [2]:
mysql_pass=os.environ.get('mysql_password')
db_connection_str = f'mysql+mysqlconnector://root:{mysql_pass}@localhost/bike_share'

,bike_id,checkout_time,duration_minutes,end_station_id,end_station_name,month,start_station_id,start_station_name,start_time,subscriber_type,trip_id,year
0,460,0 days 00:18:49,4,2501,5th & Bowie,1,1007,Lavaca & 6th,2016-01-01 00:18:49,Local365,8269930,2016
1,195,0 days 00:27:51,2,2563,Davis at Rainey Street,1,2563,Davis at Rainey Street,2016-01-01 00:27:51,Local365,8269933,2016
2,311,0 days 00:43:41,20,2502,Barton Springs & Riverside,1,2707,Rainey St @ Cummings,2016-01-01 00:43:41,Walk Up,8269945,2016
3,877,0 days 00:43:58,20,2502,Barton Springs & Riverside,1,2707,Rainey St @ Cummings,2016-01-01 00:43:58,Walk Up,8269946,2016
4,273,0 days 01:09:33,16,2566,Pfluger Bridge @ W 2nd Street,1,2569,East 11th St. & San Marcos,2016-01-01 01:09:33,Local365,8269949,2016
5,20,0 days 01:14:52,522,3292,East 4th & Chicon,1,2495,4th & Congress,2016-01-01 01:14:52,Local365,8269950,2016
6,553,0 days 01:15:23,16,3292,East 4th & Chicon,1,2495,4th & Congress,2016-01-01 01:15:23,Local365,8269951,2016
7,432,0 days 01:31:13,40,2711,Barton Springs @ Kinney Ave,1,2536,Waller & 6th St.,2016-01-01 01:31:13,Walk Up,8269957,2016
8,528,0 days 01:44:07,8,1008,Nueces @ 3rd,1,2563,Davis at Rainey Street,2016-01-01 01:44:07,Local365,8269962,2016
9,288,0 days 01:45:21,3,2495,4th & Congress,1,2498,Convention Center / 4th St. @ MetroRail,2016-01-01 01:45:21,Local365,8269963,2016

In [ ]:
 pd.read_sql('SELECT * FROM trips LIMIT 10', con=db_connection_str)

## Investigating Null Values

In [3]:
get_num_nulls="""
    SELECT SUM(bike_id IS NULL) AS bike_id,
        SUM(checkout_time IS NULL) AS checkout_time,
        SUM(duration_minutes IS NULL) AS duration_minutes,
        SUM(end_station_id IS NULL) AS end_station_id,
        SUM(end_station_name IS NULL) AS end_station_name,
        SUM(month IS NULL) AS month,
        SUM(start_station_id IS NULL) AS start_station_id,
        SUM(start_station_name IS NULL) AS start_station_name,
        SUM(start_time IS NULL) AS start_time,
        SUM(subscriber_type IS NULL) AS subscriber_type,
        SUM(trip_id IS NULL) AS trip_id,
        SUM(year IS NULL) AS year
    FROM trips"""
pd.read_sql(get_num_nulls, con=db_connection_str)

,bike_id,checkout_time,duration_minutes,end_station_id,end_station_name,month,start_station_id,start_station_name,start_time,subscriber_type,trip_id,year
0,723.0,0.0,0.0,19842.0,0.0,30752.0,19041.0,0.0,0.0,0.0,0.0,30752.0

### Null Station Ids

In [6]:
ids_per_end_station_name="""
    SELECT end_station_name, COUNT(DISTINCT end_station_id) AS num_ids
    FROM trips
    GROUP BY end_station_name
    ORDER BY num_ids DESC"""
pd.read_sql(ids_per_end_station_name, con=db_connection_str)

                                     end_station_name  num_ids
0                                  11th & San Jacinto        1
1                                  13th & San Antonio        1
2                                    17th & Guadalupe        1
3                                      2nd & Congress        1
4                                          3rd & West        1
..                                                ...      ...
87                                     Mobile Station        0
88                                               Shop        0
89                         Mobile Station @ Bike Fest        0
90  Zilker Park at Barton Springs & William Barton...        0
91        Mobile Station @ Boardwalk Opening Ceremony        0

[92 rows x 2 columns]

In [7]:
ids_per_start_station_name="""
    SELECT start_station_name, COUNT(DISTINCT start_station_id) AS num_ids
    FROM trips
    GROUP BY start_station_name
    ORDER BY num_ids DESC"""
pd.read_sql(ids_per_start_station_name, con=db_connection_str)

                                   start_station_name  num_ids
0                                  11th & San Jacinto        1
1                                  13th & San Antonio        1
2                                    17th & Guadalupe        1
3                                      2nd & Congress        1
4                                          3rd & West        1
..                                                ...      ...
85                         Mobile Station @ Unplugged        0
86                                MapJam at Scoot Inn        0
87                                        Re-branding        0
88  Zilker Park at Barton Springs & William Barton...        0
89                            Red River @ LBJ Library        0

[90 rows x 2 columns]

In [10]:
end_station_without_id="""
    SELECT end_station_name, COUNT(DISTINCT end_station_id) AS num_ids, COUNT(*) AS num_trips
    FROM trips
    GROUP BY end_station_name
    HAVING num_ids <1
    ORDER BY num_trips DESC"""
pd.read_sql(end_station_without_id, con=db_connection_str)

                                     end_station_name  num_ids  num_trips
0   Zilker Park at Barton Springs & William Barton...        0      13032
1                                   ACC - West & 12th        0       2184
2                    Convention Center/ 3rd & Trinity        0       1460
3                                      Mobile Station        0        905
4                   East 11th Street at Victory Grill        0        761
5                             Red River @ LBJ Library        0        544
6                                    Customer Service        0        152
7                                         Repair Shop        0        143
8                          Mobile Station @ Bike Fest        0        106
9                               MapJam at Pan Am Park        0         39
10                                               Shop        0         39
11                          MapJam at French Legation        0         29
12                     MapJam at Hops & Grain Brewery        0         26
13                                            Missing        0         25
14                                MapJam at Scoot Inn        0         19
15                                             Stolen        0         15
16                         Mobile Station @ Unplugged        0         13
17                                    Marketing Event        0         12
18        Mobile Station @ Boardwalk Opening Ceremony        0          4
19                                          Main Shop        0          2
20                                        Re-branding        0          2

In [11]:
start_station_without_id="""
    SELECT start_station_name, COUNT(DISTINCT start_station_id) AS num_ids, COUNT(*) AS num_trips
    FROM trips
    GROUP BY start_station_name
    HAVING num_ids <1
    ORDER BY num_trips DESC"""
pd.read_sql(start_station_without_id, con=db_connection_str)

                                   start_station_name  num_ids  num_trips
0   Zilker Park at Barton Springs & William Barton...        0      11534
1                                   ACC - West & 12th        0       2462
2                    Convention Center/ 3rd & Trinity        0       1292
3                                      Mobile Station        0       1183
4                   East 11th Street at Victory Grill        0       1030
5                             Red River @ LBJ Library        0        584
6                          Mobile Station @ Bike Fest        0        516
7                               MapJam at Pan Am Park        0         32
8                           MapJam at French Legation        0         27
9                      MapJam at Hops & Grain Brewery        0         19
10                                        Repair Shop        0         13
11                                MapJam at Scoot Inn        0         11
12                                               Shop        0         10
13        Mobile Station @ Boardwalk Opening Ceremony        0          9
14                                        Re-branding        0          7
15                                   Customer Service        0          4
16                                    Marketing Event        0          4
17                         Mobile Station @ Unplugged        0          4

In [12]:
station_names_per_start_id="""
SELECT start_station_id, COUNT(DISTINCT start_station_name) AS num_station_names
FROM trips
GROUP BY start_station_id
ORDER BY num_station_names DESC"""
pd.read_sql(station_names_per_start_id, con=db_connection_str)

    start_station_id  num_station_names
0                NaN                 19
1             1001.0                  2
2             1002.0                  1
3             1003.0                  1
4             1005.0                  1
..               ...                ...
67            3660.0                  1
68            3684.0                  1
69            3685.0                  1
70            3686.0                  1
71            3687.0                  1

[72 rows x 2 columns]

In [13]:
station_names_per_end_id="""
SELECT end_station_id, COUNT(DISTINCT end_station_name) AS num_station_names
FROM trips
GROUP BY end_station_id
ORDER BY num_station_names DESC"""
pd.read_sql(station_names_per_end_id, con=db_connection_str)

    end_station_id  num_station_names
0              NaN                 22
1           1001.0                  1
2           1002.0                  1
3           1003.0                  1
4           1005.0                  1
..             ...                ...
67          3660.0                  1
68          3684.0                  1
69          3685.0                  1
70          3686.0                  1
71          3687.0                  1

[72 rows x 2 columns]

In [14]:
duplicated_id="""SELECT *
FROM trips
WHERE start_station_ID=1001"""
pd.read_sql(duplicated_id, con=db_connection_str)

,bike_id,checkout_time,duration_minutes,end_station_id,end_station_name,month,start_station_id,start_station_name,start_time,subscriber_type,trip_id,year
0,409,0 days 16:34:57,4,3455,Republic Square @ Federal Courthouse Plaza,3,1001,Main Office,2017-03-01 16:34:57,Local365,13890701,2017
1,315,0 days 12:37:33,198,1001,Main Office,3,1001,Main Office,2017-03-07 12:37:33,Local365,13948351,2017
2,995,0 days 11:12:00,22,2567,Palmer Auditorium,3,1001,Main Office,2017-03-10 11:12:00,Local30,13986174,2017
3,621,0 days 17:50:05,47,2542,Plaza Saltillo,3,1001,Main Office,2017-03-10 17:50:05,Weekender,13992957,2017
4,60,0 days 09:58:24,17,2498,Convention Center / 4th St. @ MetroRail,3,1001,Main Office,2017-03-15 09:58:24,Local365,14042624,2017
5,610,0 days 09:31:39,105,2565,Trinity & 6th Street,3,1001,Stolen,2017-03-18 09:31:39,Local365,14088519,2017
6,281,0 days 13:14:48,3,2561,State Capitol Visitors Garage @ San Jacinto & ...,3,1001,Main Office,2017-03-20 13:14:48,Local365,14117889,2017
7,957,0 days 15:48:33,12,2566,Pfluger Bridge @ W 2nd Street,3,1001,Main Office,2017-03-27 15:48:33,Local365,14206303,2017

In [15]:
start_stolen="""
SELECT *
FROM trips
WHERE start_station_name='stolen'"""
pd.read_sql(start_stolen, con=db_connection_str)

,bike_id,checkout_time,duration_minutes,end_station_id,end_station_name,month,start_station_id,start_station_name,start_time,subscriber_type,trip_id,year
0,610,0 days 09:31:39,105,2565,Trinity & 6th Street,3,1001,Stolen,2017-03-18 09:31:39,Local365,14088519,2017

### Month and Year